
-- ===============================================================
-- פקודות Rollback ו- Commit שלב ב' - RollbackCommit.sql
-- ===============================================================

-- תצוגת בסיס נתונים מקורית עבור מדריך שמספרו 1 (לפני השינויים)
SELECT * FROM GUIDE WHERE GuideID = 1;

-- =============================================
-- דוגמא 1: עבודה עם  ROLLBACK
-- =============================================
BEGIN;

-- ביצוע עדכון זמני במערכת 
UPDATE GUIDE
SET Phone = '000-0000000'
WHERE GuideID = 1;

-- תצוגת בסיס הנתונים לאחר העדכון שטרם נשמר (נוכל לראות את הנתון החדש)
SELECT * FROM GUIDE WHERE GuideID = 1;

-- החזרת בסיס הנתונים למצבו הקודם ומחיקת השינוי מהזיכרון
ROLLBACK;

-- תצוגת בסיס הנתונים על מנת לוודא שהנתון חזר למקור
SELECT * FROM GUIDE WHERE GuideID = 1;


-- =============================================
-- דוגמא 2: עבודה עם COMMIT
-- =============================================
BEGIN;

-- ביצוע עדכון קבוע במערכת
UPDATE GUIDE
SET Expertise = 'Desert Tours - Expert'
WHERE GuideID = 1;

-- תצוגת בסיס הנתונים מתוך הטרנזקציה מציגה את השינוי
SELECT * FROM GUIDE WHERE GuideID = 1;

-- אישור לשמירת הטרנזקציה במערכת הנתונים. מנקודה זו - בלתי הפיך!
COMMIT;

-- תצוגת בסיס הנתונים לאישור הסופי שהעסקה הושלמה והמסד נתונים מעודכן
SELECT * FROM GUIDE WHERE GuideID = 1;
>>>>>>> f32bdc3 (stage 2: Add scheme, reports and constraints (stage_b copies))
